export const COLORS = {
  yellow: '#FAA41A',
  dark: '#34465E',
};

export const SUPPLY_CASES = [
  {
    text: [
      'Прозорий розрахунок собівартості тарифу відповідно до графіку споживання та ціни ДП "Оператор ринку"',
      'Мінімальний тариф постачальника',
      'Авансовий платіж без застосування коефіцієнту витрат постачальника',
    ],
  },
  {
    text: [
      'Зручний, узгоджений зі Споживачем графік авансових платежів',
      'Можливість оплати по факту декади /місяця постачання',
      'Можливість відтермінування платежів',
    ],
  },
  {
    text: [
      'Повне покриття небалансу споживання електроенергії',
      'Відсутність лімітів споживання електроенергії',
      'Відсутність штрафів за відхилення від замовлених обсягів споживання',
    ],
  },
];

export const WORK_WITH_US = [
  {
    image: 'homka.png',
    name: 'Homka',
  },
  {
    image: 'mcdonalds.png',
    name: 'McDonalds',
  },
  {
    image: 'pulp-mill-print.png',
    name: 'PulpMillPrint',
  },
  {
    image: 'tulchin.png',
    name: 'Tulchin',
  },
  {
    image: 'square.jpg',
    name: 'Square',
  },
  {
    image: 'ufc.jpg',
    name: 'UFC',
  },
  {
    image: 'cpi.jpg',
    name: 'CPI',
  },
  {
    image: 'fregat.jpg',
    name: 'Fregat',
  },
];

export const CHANGE_SUPPLIER = [
  {
    step: 'КРОК 1',
    text:
      'Заповнення опитувального листа для підготовки комерційної пропозиції.',
    buttons: [{ name: 'Опитувальний лист', file: 'ОПИТУВАЛЬНИЙ_ЛИСТ_ХЕ.docx' }],
  },
  {
    step: 'КРОК 2',
    text:
      'Узгодження та підписання договору постачання електричної енергії та комерційної пропозиції з новим постачальником.',
    buttons: [
      { name: 'Комерційна пропозиція', file: 'Комерційна_пропозиція.docx' },
      { name: 'Договор', file: 'ДОГОВІР_ХЕ.docx' },
    ],
  },
  {
    step: 'КРОК 3',
    text:
      'Скан-копію заповненої та підписаної Заяви-приєднання Споживач надсилає на електрону адресу нового постачальника, водночас надсилає чинному постачальнику повідомлення щодо зміни.',
    buttons: [{ name: 'Заява-приєднання', file: 'ЗАЯВА-приєднання.docx' }],
  },
  {
    step: 'КРОК 4',
    text:
      'Новий Постачальник формує запит на зміну та направляє до відповідного обленерго.',
    buttons: [],
  },
  {
    step: 'КРОК 5',
    text:
      'В продовж 3-х робочих днів обленерго розглядає запит та погоджує перехід.',
    buttons: [],
  },
];

export const INFO_CENTER = [
  {
    title: 'Нормативно-правова база',
    icon: 1,
    text: [
      '- Закон України “Про ринок електричної енергії” (від 13.04.2017 № 2019-VIII)',
      '- “Ліцензійні умови провадження господарської діяльності з постачання електричної енергії споживачу”, затверджені постановою НКРЕКП від 27.12.2017 № 1469',
    ],
  },
  {
    title: 'Посилання до державних органів і операторів систем',
    icon: 2,
    text: [
      '- Національна комісія, що здійснює державне регулювання у сфері енергетики та комунальних послуг',
      '- Державна інспекція енергетичного нагляду України',
      '- Міністрство енергетики та вугільної промисловості України',
      '- Оптовий постачальник електроенергії; Головний Оператор системи',
    ],
  },
  {
    title: 'Вирішення спорів',
    icon: 3,
    text: [
      'У випадку виникнення спірних питань, звертайтеся за адресою:',
      '- м. Київ, вул. Хохлових Сім’ї, буд.8. офіс 9',
      "- Режим роботи : понеділок-п'ятниця з 08: 00 до 18:00",
      '- тел. 097 000 00 92',
      '- email: info.htst@gmail.com',
      '- Особа відповідальна за врегулювання спорів : Директор Фененко Поліна Олександрівна',
    ],
  },
  {
    title: 'Права споживачів',
    icon: 4,
    text: [
      '- Закон України “Про ринок електричної енергії” (від 13.04.2017 № 2019-VIII)',
      '- “Ліцензійні умови провадження господарської діяльності з постачання електричної енергії споживачу”, затверджені постановою НКРЕКП від 27.12.2017 № 1469',
    ],
  },
];

export const FAQ = [
  {
    question:
      'Звикли працювати з постачальником, що підпорядко- ваний обленерго, бо він «стабільний та надійний».',
    answer:
      'Зверніть увагу, постачальники, що утворились з 01.01.2019 року на базі обленерго, як і абсолютна більшість незалежних постачальників, мають однакову організаційну правову форму, а отже однакові права та обов’язки згідно норм Госпо- дарського права України.',
  },
  {
    question:
      'Відключать електроенергію, якщо змінемо постачаль- ника, підконтрольного обленерго.',
    answer:
      'Не відключать! В рамках роботи нового ринку електричної енергії на всі без винятку обленерго, як власників електроме- реж, покладено функцію оператору розподілу, за що вони отримають плату від споживача у частині тарифу за електрич- ну енергію (плата за розподіл). Постачальник продає товар (електричну енергію), обленерго передає такий товар власними електромережами.\nВідтак обов’язком оператора системи розподілу є: дотримання показників якості електропостачання; забезпечення рівня надійності (безперервності) електропостачання\nТрьохстороння взаємодія: Споживач та Обленерго продовжують діяти в рамках двостороннього договору на розподіл, та Постачальник в свою чергу має договірна розподіл з Обленерго.\nБільш того, згідно чинного законодавства Оператор системи розподілу не має права відмовляти у розподілі електричної енергії електропостачальникам та споживачам!',
  },
  {
    question: 'Зміна постачальника – це додаткові витрати.',
    answer:
      'Зміна постачальника –безкоштовна процедура, досить проста та коротка у часі. Єдине, що потрібно від Споживача –це заповнена та підписана Заява-приєднання до договору постачання електричної енергії та виписка з ЄДРПОУ. Проведення процедури зміни відбувається новим постачальником сумісно з обленерго.',
  },
  {
    question: 'Заплатимо аванс, а кошти зникнуть.',
    answer:
      'Кошти не зникнуть, оскільки споживач сплачує за елек- тричну енергію виключно на рахунок зі спеціальним режи- мом використання, який має постачальник у уповноваже- ному банку -АТ «Ощадбанк» (згідно Правил ринку ЕЕ). Кошти, що потрапляють на такий рахунок, спрямовуються виключно на придбання електричної енергії. Постачальник має право лише перегляду такого рахунку, а розпоряджається ним АТ «Ощадбанк».',
  },
  {
    question:
      'Раптом постачальник отримає статус «дефолтного» та не зможе продовжувати купувати електроенергію',
    answer:
      'Така ситуація не можлива, оскільки статусу «дефолтний» передує статус «переддефолтний», який постачальник набуває у випадку невиконання своїх фінансових обов’язків перед учасниками ринку. Однак, в разі якщо постачальник за будь-яких причин отримав статус «переддефолтний» та немає змоги сплатити свої зобов’язання, така сума списується авто- матично з фінансової гарантії, яку постачальник зобов’язаний внести до ПрАТ НЕК Укренерго до початку роботи у ринку.',
  },
  {
    question: 'Раптом постачальник припинить свою діяльність.',
    answer:
      'Повертаючись до відповіді No1, будь-який постачальник –суб’єкт підприємницької діяльності може припинити свою діяльності з огляду на суб’єктивні чи об’єктивні обставини, в тому числі і ті ТОВки, що створені на базі обленерго.',
  },
];
