export const COLORS = {
  yellow: '#FAA41A',
};

export const SUPPLY_CASES = [
  {
    text: [
      'Прозорий розрахунок собівартості тарифу відповідно до графіку споживання та ціни ДП "Оператор ринку"',
      'Мінімальний тариф постачальника',
      'Авансовий платіж без застосування коефіцієнту витрат постачальника',
    ],
  },
  {
    text: [
      'Зручний, узгоджений зі Споживачем графік авансових платежів',
      'Можливість оплати по факту декади /місяця постачання',
      'Можливість відтермінування платежів',
    ],
  },
  {
    text: [
      'Повне покриття небалансу споживання електроенергії',
      'Відсутність лімітів споживання електроенергії',
      'Відсутність штрафів за відхилення від замовлених обсягів споживання',
    ],
  },
];

export const WORK_WITH_US = [
  {
    image: 'homka.png',
    name: 'Homka',
  },
  {
    image: 'mcdonalds.png',
    name: 'McDonalds',
  },
  {
    image: 'pulp-mill-print.png',
    name: 'PulpMillPrint',
  },
  {
    image: 'tulchin.png',
    name: 'Tulchin',
  },
];
